jobs/20260729-120145-luqia-vllm-nogate-short-high-rps-queue/slurm-250242.out

===== scheduler_sweep_with_saturation_gate =====
workload_source=Dual_Sweep_LLM_Phase2_common_measured_grid
slo_ttft_ms=500 slo_tpot_ms=200 saturation_threshold=0.30
saturation_model=five_seed_mean_local_retrained_75
placement=l40s-prefill-l4-decode
overload_action=min-slo-violation
online_scheduling=true max_l4_freq=none max_l40s_freq=2520
kv_effective_bandwidth_gbps=24.076 kv_num_layers=32 kv_num_heads=8 kv_head_dim=128 kv_bytes_per_element=2 dispatch_ms=0
clock_mismatch_action=continue clock_ack_mode=monitor clock_ack_transport=http_with_file_fallback
scheduler_enabled=true active_scheduler_policy=latency_only gpu_clock_control_mode=manual policy_label=gate_off_short_high_rps_queue
scheduler_workload seq=1 id=short_baseline il=32 ol=32 rate=1 online=true active_policy=latency_only
scheduler_selected seq=1 policy=latency_only status=OK prefill=neptune:480 decode=ganymede:360 predicted_cluster_power_w=147.8

===== allocation =====
time=2026-07-29T12:05:43+02:00
batch_host=ganymede
SLURM_JOB_ID=250242
SLURM_JOB_NODELIST=ganymede,neptune
model=mistralai/Mistral-7B-v0.1 workload_count=3 slurm_time_limit=00:28:00
ganymede
neptune
JobId=250242 JobName=20260729-120145-luqia-vllm-nogate-short-high-rps-queue
   UserId=chjing(10271) GroupId=root(0) MCS_label=N/A
   Priority=1 Nice=0 Account=student QOS=normal
   JobState=RUNNING Reason=None Dependency=(null)
   Requeue=1 Restarts=0 BatchFlag=1 Reboot=0 ExitCode=0:0
   RunTime=00:00:01 TimeLimit=01:00:00 TimeMin=N/A
   SubmitTime=2026-07-29T12:05:42 EligibleTime=2026-07-29T12:05:42
   AccrueTime=2026-07-29T12:05:42
   StartTime=2026-07-29T12:05:42 EndTime=2026-07-29T13:05:42 Deadline=N/A
   SuspendTime=None SecsPreSuspend=0 LastSchedEval=2026-07-29T12:05:42 Scheduler=Main
   Partition=long AllocNode:Sid=minerva:919086
   ReqNodeList=ganymede,neptune ExcNodeList=(null)
   NodeList=ganymede,neptune
   BatchHost=ganymede
   NumNodes=2 NumCPUs=256 NumTasks=2 CPUs/Task=16 ReqB:S:C:T=0:0:*:*
   ReqTRES=cpu=16,mem=128G,node=2,billing=16,gres/gpu=2
   AllocTRES=cpu=256,mem=128G,node=2,billing=256,gres/gpu=4,gres/gpu:l4=8,gres/gpu:l40s=4
   Socks/Node=* NtasksPerN:B:S:C=1:0:*:* CoreSpec=*
   MinCPUsNode=16 MinMemoryNode=64G MinTmpDiskNode=0
   Features=(null) DelayBoot=00:00:00
   OverSubscribe=NO Contiguous=0 Licenses=(null) Network=(null)
   Command=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260729-120145-luqia-vllm-nogate-short-high-rps-queue/run.sbatch
   WorkDir=/data/users/chjing/Sweep_LLM_Jobs_broker
   StdErr=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260729-120145-luqia-vllm-nogate-short-high-rps-queue/slurm-250242.err
   StdIn=/dev/null
   StdOut=/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260729-120145-luqia-vllm-nogate-short-high-rps-queue/slurm-250242.out
   Power=
   TresPerNode=gres/gpu:1
   TresPerTask=cpu:8
   


===== 100gbe_and_environment_preflight =====
[NVGPUFREQ][INFO] The spank nvgpufreq plugin has been loaded!
[NVGPUFREQ][ERROR] Failed to retrive the job ID from slurmctld! Exit!
host=ganymede node_group=ganymede role=decode mode=preflight
scheduled_gpu=l4 scheduled_freq_mhz=360 gpu_id=0
gpu_clock_control_mode=manual
clock_ack_mode=monitor
node_ip=10.1.0.3 peer_ip=10.1.0.6 interface=eno12399np0
CUDA_VISIBLE_DEVICES=0
eno12399np0      UP             10.1.0.3/16 fe80::632:1ff:fe4d:80/64 
10.1.0.6 dev eno12399np0 src 10.1.0.3 uid 10271 
    cache 
link_speed_mbps=100000
link_mtu=1500
host=neptune node_group=neptune role=prefill mode=preflight
scheduled_gpu=l40s scheduled_freq_mhz=480 gpu_id=0
gpu_clock_control_mode=manual
clock_ack_mode=monitor
node_ip=10.1.0.6 peer_ip=10.1.0.3 interface=enp160s0f0np0
CUDA_VISIBLE_DEVICES=0
enp160s0f0np0    UP             10.1.0.6/16 fe80::6e92:cfff:fe5e:cc00/64 
10.1.0.3 dev enp160s0f0np0 src 10.1.0.6 uid 10271 
    cache 
link_speed_mbps=100000
link_mtu=1500
index, name, memory.total [MiB], driver_version
0, NVIDIA L4, 23034 MiB, 595.71.05
1, NVIDIA L4, 23034 MiB, 595.71.05
2, NVIDIA L4, 23034 MiB, 595.71.05
3, NVIDIA L4, 23034 MiB, 595.71.05
4, NVIDIA L4, 23034 MiB, 595.71.05
5, NVIDIA L4, 23034 MiB, 595.71.05
6, NVIDIA L4, 23034 MiB, 595.71.05
7, NVIDIA L4, 23034 MiB, 595.71.05
index, name, memory.total [MiB], driver_version
0, NVIDIA L40S, 46068 MiB, 595.71.05
1, NVIDIA L40S, 46068 MiB, 595.71.05
2, NVIDIA L40S, 46068 MiB, 595.71.05
3, NVIDIA L40S, 46068 MiB, 595.71.05
host=ganymede import=torch version=2.9.1+cu128
host=ganymede import=vllm version=0.15.1
host=ganymede import=aiohttp version=3.13.3
host=ganymede import=msgpack version=1.1.2
host=ganymede import=zmq version=27.1.0
host=neptune import=torch version=2.9.1+cu128
host=neptune import=vllm version=0.15.1
host=neptune import=aiohttp version=3.13.3
host=neptune import=msgpack version=1.1.2
host=neptune import=zmq version=27.1.0
preflight_rc=0

===== start_proxy =====
proxy_pid=2384224
waiting name=proxy elapsed_s=5 url=http://127.0.0.1:30242/health
ready name=proxy elapsed_s=5 url=http://127.0.0.1:30242/health

===== start_prefill_and_decode_once =====
server_step_pid=2384231
waiting name=prefill elapsed_s=5 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=10 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=15 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=20 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=25 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=30 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=35 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=40 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=45 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=50 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=55 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=60 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=65 url=http://10.1.0.6:32242/v1/models
waiting name=prefill elapsed_s=70 url=http://10.1.0.6:32242/v1/models
ready name=prefill elapsed_s=70 url=http://10.1.0.6:32242/v1/models
ready name=decode elapsed_s=0 url=http://10.1.0.3:33242/v1/models

===== wait_for_pd_registry =====
{"prefill": ["10.1.0.6:32242"], "decode": ["10.1.0.3:33242"]}
registry_ready=true

===== pd_smoke_request =====
smoke_curl_rc=0
vllm_burstiness_supported=true

===== multi_workload_bench =====

===== workload_1_short_baseline =====
workload_start time=2026-07-29T12:07:08+02:00 seq=1 id=short_baseline il=32 ol=32 request_rate=1 window_seconds=12 burstiness=1.0 description=short_request_low_rate_baseline
fixed_placement prefill_node=neptune decode_node=ganymede gpu_clock_control_mode=manual
recommendation neptune_prefill_mhz=480 ganymede_decode_mhz=360 predicted_cluster_power_w=147.8
clock_request seq=1 neptune_mhz=480 ganymede_mhz=360
clock_ack seq=1 node_group=neptune target_mhz=480 rc=0 observed_mhz=480 verification_mode=monitor transport=http
clock_ack seq=1 node_group=ganymede target_mhz=360 rc=0 observed_mhz=360 verification_mode=monitor transport=http
bench_config num_prompts=12 nominal_window_s=12 timeout_s=900 max_concurrency=512 finite_rate_random_arrivals=true burstiness_applied=true burstiness_value=1.0 save_detailed=true
energy_event unix_ts=1785319689.237945780 event=workload_start seq=1 workload_id=short_baseline
energy_event unix_ts=1785319727.187771079 event=workload_end seq=1 workload_id=short_baseline
bench_rc=0 seq=1 id=short_baseline
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7b43524b1120>, seed=0, num_prompts=12, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=32, random_output_len=32, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://10.1.0.3:30242', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=512, model='mistralai/Mistral-7B-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=1, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='/data/users/chjing/Sweep_LLM_Jobs_broker/jobs/20260729-120145-luqia-vllm-nogate-short-high-rps-queue/queue_backlog_results', result_filename='detailed_1_short_baseline.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-16cc6ecb-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 07-29 12:08:30 [datasets.py:612] Sampling input_len from [31, 31] and output_len from [32, 32]
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 1 requests...
100%|██████████| 1/1 [00:02<00:00,  2.07s/it]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 512
100%|██████████| 12/12 [00:14<00:00,  1.19s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     12        
Failed requests:                         0         
Maximum request concurrency:             512       
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  14.25     
Total input tokens:                      372       
Total generated tokens:                  384       
Request throughput (req/s):              0.84      
Output token throughput (tok/s):         26.94     
Peak output token throughput (tok/s):    51.00     
Peak concurrent requests:                5.00      
Total token throughput (tok/s):          53.04     
---------------Time to First Token----------------
Mean TTFT (ms):                          242.62    
Median TTFT (ms):                        248.29    
P99 TTFT (ms):                           288.49    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          63.91     
Median TPOT (ms):                        64.37     
P99 TPOT (ms):                           64.80     
---------------Inter-token Latency----------------
Mean ITL (ms):                           63.91     
Median ITL (ms):                         64.10     
P99 ITL (ms):                            73.96     
==================================================
bench_request_counts seq=1 id=short_baseline successful=12 failed=0

===== online_scheduler_window_2_short_high_rps_queue =====
scheduler_workload seq=2 id=short_high_rps_queue il=32 ol=32 rate=32 online=true active_policy=latency_only
scheduler_selected seq=2 policy=latency_only status=OK prefill=neptune:735 decode=ganymede:2040 predicted_cluster_power_w=190.3

===== workload_2_short_high_rps_queue =====
workload_start time=2026-07-29T12:08:47+02:00 seq=2 id=short_high_rps_queue il=32 ol=32 request_rate=32 window_seconds=60 burstiness=4.0 description=individually_light_requests_sustained_above_capacity
fixed_placement prefill_node=neptune decode_node=ganymede gpu_clock_control_mode=manual
recommendation neptune_prefill_mhz=735 ganymede_decode_mhz=2040 predicted_cluster_power_w=190.3
clock_request seq=2 neptune_mhz=735 ganymede_mhz=2040
clock_ack seq=2 node_group=neptune target_mhz=735 rc=0 observed_mhz=480 verification_mode=monitor transport=http
clock_ack seq=2 node_group=ganymede target_mhz=2040 rc=0 observed_mhz=360 verification_mode=monitor transport=file
bench_config num_prompts=1920 nominal_window_s=60 timeout_s=900 max_concurrency=512 finite_rate_random_arrivals=true burstiness_applied=true burstiness_value=4.0 save_detailed=true
energy_event unix_ts=1785319729.081080538 event=workload_start seq=2 workload_id=short_high_rps_queue